{"id": "tech_0", "title": "No Man’s Sky Fans Are Doing Wild Stuff As The Game Hits A New Peak On Steam - Kotaku", "source": "Kotaku", "author": "Claire Jackson", "date": "2025-09-02T19:53:27Z", "content": "With the Voyagers update, it seems clear that No Man’s Sky has become the premiere space exploration sim"}
{"id": "tech_1", "title": "Xbox Game Pass September 2025 Wave 1 Lineup Confirmed — Hollow Knight: Silksong Dominates - IGN", "source": "IGN", "author": "Wesley Yin-Poole", "date": "2025-09-02T19:33:31Z", "content": "Microsoft has confirmed the Xbox Game Pass September 2025 Wave 1 lineup of titles, which is headlined by Team Cherry’s hotly anticipated Hollow Knight: Silksong."}
{"id": "tech_2", "title": "With AirPods Pro 3, Apple sounds like it’s following a winning playbook - 9to5Mac", "source": "9to5Mac", "author": "Ryan Christoffel", "date": "2025-09-02T19:19:00Z", "content": "Apple is about to launch AirPods Pro 3, and rumors indicate the company will follow the winning playbook of AirPods Pro 2 with its upgrades."}
{"id": "tech_3", "title": "This ultra-rare ’90s LaserDisc game console can finally be emulated on a PC - Ars Technica", "source": "Ars Technica", "author": "Kyle Orland", "date": "2025-09-02T18:57:19Z", "content": "You don’t have to track down pricey retro hardware to play the Pioneer LaserActive anymore."}
{"id": "tech_4", "title": "Microsoft gave Perfect Dark’s developers a chance to save the game — after it was already canceled - The Verge", "source": "The Verge", "author": "Sean Hollister", "date": "2025-09-02T18:49:00Z", "content": "IP ownership strikes again."}
{"id": "tech_5", "title": "Google says Gmail security is “strong and effective” as it denies major breach - Ars Technica", "source": "Ars Technica", "author": "Ryan Whitwam", "date": "2025-09-02T18:39:44Z", "content": "Google refutes claims that all 2.5 billion Gmail users are at risk."}
{"id": "tech_6", "title": "Lighter, Cheaper Vision Air Coming in 2027 - MacRumors", "source": "MacRumors", "author": "Juli Clover", "date": "2025-09-02T18:15:31Z", "content": "Apple plans to release a lighter weight and more affordable version of the Vision Pro in 2027, according to Apple analyst Ming-Chi Kuo.   The..."}
{"id": "tech_7", "title": "Apple is already raising iPhone Fold expectations in a big way, per report - 9to5Mac", "source": "9to5Mac", "author": "Ryan Christoffel", "date": "2025-09-02T18:13:00Z", "content": "Apple’s first iPhone Fold is coming next fall, and per a new report the company is already raising internal expectations for consumer demand."}
{"id": "tech_8", "title": "‘Perfect Dark’ Developer Lays Off Staff After Funding Deal Falls Through - Bloomberg.com", "source": "Bloomberg", "author": "Jason Schreier", "date": "2025-09-02T17:37:16Z", "content": "Crystal Dynamics was close to moving the game to Take-Two, but negotiations fell apart"}
{"id": "tech_9", "title": "Apple Seeds Ninth Developer Betas of iOS 26 and iPadOS 26 - MacRumors", "source": "MacRumors", "author": "Juli Clover", "date": "2025-09-02T17:18:17Z", "content": "Apple today provided developers with the ninth betas of iOS 26 and iPadOS 26 for testing purposes, with the updates coming a week after Apple seeded..."}
{"id": "tech_10", "title": "Review: SHINOBI: Art Of Vengeance (Switch) - A Beautifully Crafted Return For Joe Musashi - Nintendo Life", "source": "Nintendo Life", "author": "Nintendo Life", "date": "2025-09-02T17:00:00Z", "content": "Knives out"}
{"id": "tech_11", "title": "Astro Bot PS5 Controller Returns In October, Good Luck Pre-Ordering It - Kotaku", "source": "Kotaku", "author": "Zack Zwiezen", "date": "2025-09-02T16:59:54Z", "content": "The new 'Joyful' version of the Bot-themed Dualsense will be available to pre-order later this month"}
{"id": "tech_12", "title": "PlayStation's 'Helldivers 2' lands the top spot on the Xbox Store — could more be on the way? - Windows Central", "source": "Windows Central", "author": "Jez Corden", "date": "2025-09-02T16:45:35Z", "content": "PlayStation and Xbox have been playing nice this summer, and this latest sales milestone might be a good indicator for what could happen next."}
{"id": "tech_13", "title": "WordPress shows off Telex, its experimental AI development tool - TechCrunch", "source": "TechCrunch", "author": "Sarah Perez", "date": "2025-09-02T16:26:48Z", "content": "WordPress CEO Matt Mullenweg introduced the new WordPress AI tool, called Telex, at the company's WordCamp US 2025 conference in Portland last week, alongside other AI experiments."}
{"id": "tech_14", "title": "Google teases new Nest Cam and Gemini updates for Home coming on October 1 - 9to5Google", "source": "9to5google.com", "author": "Ben Schoon", "date": "2025-09-02T16:22:00Z", "content": "Google is teasing an October 1 reveal for its new Nest Cam hardware as well as Gemini updates for the Home app and experience."}
{"id": "tech_15", "title": "Fallout 76 Gameplay and Accessibility Settings Guide - Bethesda.net", "source": "Bethesda.net", "author": "Unknown", "date": "2025-09-02T16:16:44Z", "content": "Here’s a look at the available settings that allow you to personalize your Fallout 76 experience."}
{"id": "tech_16", "title": "33.4 Patch Notes — Hearthstone - Blizzard News", "source": "Blizzard.com", "author": "Unknown", "date": "2025-09-02T16:00:00Z", "content": "The Day of Rebirth Mini-Set, new in-game events, and more await in Patch 33.4!"}
{"id": "tech_17", "title": "Fallout 76: C.A.M.P Revamp Combat Release Notes (FULL) - Bethesda.net", "source": "Bethesda.net", "author": "Unknown", "date": "2025-09-02T15:52:02Z", "content": "Here’s all you need to know about the combat balancing changes arriving in the Fallout 76: C.A.M.P. Revamp update."}
{"id": "tech_18", "title": "Samsung 9100 PRO 8TB PCIe Gen5 NVMe SSD Review - ServeTheHome", "source": "Servethehome.com", "author": "Will Taillac", "date": "2025-09-02T15:20:27Z", "content": "The Samsung 9100 Pro 8TB is a high-capacity and PCIe Gen5 NVMe SSD that delivers on excellent performance promises"}
{"id": "sci_0", "title": "\"Space Has a Tesla Floating Forever\": Elon Musk's Cherry-Red Roadster Orbits Sun With Starman Mannequin Driving for Millions of Years - Rude Baguette", "source": "Rudebaguette.com", "author": "Noah Bennett", "date": "2025-09-02T19:55:36Z", "content": "Humanity's journey into space has been marked not only by scientific and technological achievements but also by cultural milestones that underscore our desire"}
{"id": "sci_1", "title": "As the Great Salt Lake Shrinks, Something Unexpected Is Rising to the Surface - Gizmodo", "source": "Gizmodo.com", "author": "Ellyn Lapointe", "date": "2025-09-02T19:21:11Z", "content": "Across this gray, cracked wasteland, signs of life have emerged."}
{"id": "sci_2", "title": "Scientists Pinpoint Cause of Mysterious Electrical Surges on Satellites - Gizmodo", "source": "Gizmodo.com", "author": "Passant Rabie", "date": "2025-09-02T17:40:43Z", "content": "A new study measured the correlation between the number of electrons in space and the sudden release of electrical charges from satellites."}
{"id": "sci_3", "title": "Watch live as jetliner-sized asteroid passes about half the distance between Earth, Moon this week - FOX Weather", "source": "Foxweather.com", "author": "Emilee Speck", "date": "2025-09-02T15:57:00Z", "content": "The recently discovered asteroid 2025 QD8 will zoom closely by Earth on Wednesday. However, there is no need to be concerned."}
{"id": "sci_4", "title": "I watched scientists view the interstellar comet 3I/ATLAS in real time. Here's what they saw - Space", "source": "Space.com", "author": "Kenna Hughes-Castleberry", "date": "2025-09-02T15:00:00Z", "content": "\"Once these objects get too faint to see, they will never be seen again,\""}
{"id": "sci_5", "title": "Earth could be sitting in the centre of a giant cosmic void, according to astronomers - BBC Sky at Night Magazine", "source": "Skyatnightmagazine.com", "author": "Anita Chandran", "date": "2025-09-02T13:19:31Z", "content": "Earth could be sitting in the centre of a giant cosmic void, according to astronomers. The theory could help resolve the Hubble tension."}
{"id": "sci_6", "title": "Humans inherited genes from Neanderthals that still limit our muscle activity - Earth.com", "source": "Earth.com", "author": "Unknown", "date": "2025-09-02T13:11:28Z", "content": "A new study reveals that a gene inherited from Neanderthals reduces muscle activity and may influence athletic performance."}
{"id": "sci_7", "title": "Earth's Rotation Is Slowing, And It Might Explain Why We Have Oxygen - ScienceAlert", "source": "ScienceAlert", "author": "Michelle Starr", "date": "2025-09-02T13:03:50Z", "content": "Ever since its formation around 4.5 billion years ago, Earth's rotation has been gradually slowing down, and its days have gotten progressively longer as a result."}
{"id": "sci_8", "title": "How magnets could help astronauts explore the moon and Mars - Space", "source": "Space.com", "author": "Andrew Jones", "date": "2025-09-02T13:00:00Z", "content": "Magnets could make bulky centrifuges obsolete in space oxygen systems."}
{"id": "sci_9", "title": "TESS reveals two rocky Earth-sized exoplanets orbiting nearby K-type star - Phys.org", "source": "Phys.Org", "author": "Tomasz Nowakowski", "date": "2025-09-02T12:00:02Z", "content": "Using NASA's Transiting Exoplanet Survey Satellite (TESS), astronomers have discovered two rocky exoplanets orbiting a nearby K-type star, known as TOI-2322. The newfound alien worlds are comparable in size to Earth and have relatively short orbital periods. …"}
{"id": "sci_10", "title": "3D atlas of solar system shows all the asteroids too - Boing Boing", "source": "Boing Boing", "author": "Rob Beschizza", "date": "2025-09-02T11:10:39Z", "content": "It's an exemplary interactive visualization and the antidote to those \"not even right\" vortex animations on YouTube"}
{"id": "sci_11", "title": "The search for Earth’s most mysterious creatures is turning up extraordinary results - vox.com", "source": "Vox", "author": "Benji Jones", "date": "2025-09-02T11:00:00Z", "content": "Earth’s biodiversity, including insects, is still largely unexplored. Biologists are searching for new species to expose “dark taxa” and learn how ecosystems work."}
{"id": "sci_12", "title": "Light It Right: How to Block UV Rays From Infiltrating Your Interiors - Mansion Global", "source": "Mansion Global", "author": "Jennifer Tzeses", "date": "2025-09-02T10:35:00Z", "content": "Enjoy the mental and physical benefits of sunlight in your home while preventing its potential dangers"}
{"id": "sci_13", "title": "\"NASA Tests Nuclear Fuel Lasting 432 Years\": Americium-241 Powers Spacecraft With Stirling Generators That Never Stop Running Tomorrow - Energy Reporters", "source": "Energy-reporters.com", "author": "Gabriel Cruz", "date": "2025-09-02T10:08:46Z", "content": "NASA's pursuit of innovative space exploration technologies has taken a significant leap forward with the development of a new nuclear fuel, americium-241."}
{"id": "sci_14", "title": "No suffering, no death, no limits: the nanobots pipe dream - Aeon", "source": "Aeon.co", "author": "Philip Ball", "date": "2025-09-02T10:02:42Z", "content": "Thirty years ago, nanotech was about to change everything. Let’s not get tricked again by Silicon Valley’s magical thinking"}
{"id": "sci_15", "title": "‘Blood Moon’ Eclipse September 2025: When To See The ‘Corn Moon’ Rise - Forbes", "source": "Forbes", "author": "Jamie Carter", "date": "2025-09-02T10:00:00Z", "content": "Everything you need to know about September’s full corn moon — also a total lunar eclipse — including exactly when, where, and how to see it at its best."}
{"id": "sci_16", "title": "Unifying gravity and quantum theory requires better understanding of time - Nature", "source": "Nature.com", "author": "Unknown", "date": "2025-09-02T09:22:30Z", "content": "Textbooks give strange, imprecise explanations of where things happen in quantum mechanics. Consistency with gravity needs a fresh approach."}
{"id": "sci_17", "title": "'It's a way of the sea returning the trash to us': Why plastic-filled 'Neptune balls' are washing up on beaches - BBC", "source": "BBC News", "author": "Frankie Adkins", "date": "2025-09-02T09:09:42Z", "content": "As tiny pieces of plastic clog our oceans, natural meadows of seagrass are bundling up microplastics and spitting them back out onto beaches in the form of \"Neptune balls\"."}
{"id": "sci_18", "title": "Giant sandy 'slug' crawls through floodplains in Kazakhstan, but it could soon be frozen in place — Earth from space - Live Science", "source": "Live Science", "author": "Harry Baker", "date": "2025-09-02T07:00:00Z", "content": "A 2022 astronaut photo shows a peculiar, slug-shaped dune field in the heart of the Kazakh Steppe. Signs of vegetation among the sand suggest these dunes are in the process of being fixed in place."}
